#start
frst_text = '''
🏠* СЕТЬ РИЭЛТОРА AI - твой ИИ-помощник для презентации объектов недвижимости!

🚀 Что умеет: *
1️⃣ *Преображает обычные планировки в продающие* — просто загрузи схему, выбери стиль, и получи визуал, от которого у покупателей загорятся глаза.
2️⃣ *Превращает фото даже «убитых» квартир в дизайн-шедевр* с сохранением геометрии помещения, стен и окон. Покажи покупателям квартиру мечты!
🎁 *Дарим 2 бесплатных дизайна на тест* — попробуй прямо сейчас и посмотри, как это работает.

👇 Жми «Начать» и загружай свой первый объект!
'''
start_hello = 'Добро пожаловать в СЕТЬ РИЭЛТОРА AI 🚀'
def start_plan(is_sub, tokens):
    tokens_text = f'🎁 У тебя есть *{tokens} бесплатных дизайна* на тест — используй с умом 😉'
    if is_sub == '1':
        tokens_text = f'🔋 У тебя есть *{tokens} генераций дизайна*'
    if int(tokens) <= 0:
        tokens_text = '😢 У вас закончились генерации. Пополните, используя команду /sub'

    return f'''
*1️⃣ Выбери, что нужно:*

	• 🏗 *Дизайн планировок* — загрузи схему помещения (фото, скан или PDF), выбери стиль — и получи визуал, который продаёт.
	
	• 🛋 *Редизайн интерьера* — получите реалистичный дизайн помещения в новом стиле, сохранив планировку.
	
	• 🆕 *Дизайн с нуля* — загрузи фото пустого помещения — получи визуализацию, которая помогает продавать дороже.
	
	
2️⃣ *Выбери стиль* — минимализм, сканди, современный, классика и др.

3️⃣ Получи готовый дизайн за 1–2 минуты 💡

{tokens_text}

Готов? Загружай первый файл прямо сюда 👇
'''
HELP='''🆘 Нажмите на кнопку, чтобы обратиться в поддержку 👇'''

#design_plane
TEXT_GET_FILE = "Загрузи *план помещения* — подойдёт ссылка, фото (jpeg, jpg, png), скан или PDF."
TEXT_GET_PLAN_TYPE = """
Какой вариант планировки хочешь получить? 👇
🔲 2D визуализация — стильная плоская схема, отлично подходит для Авито, сайтов и презентаций.
🏠 3D визуализация — объёмное изображение с мебелью и текстурами, помогает покупателю «влюбиться» в пространство.
✏️ Выбери вариант кнопкой ниже — и поехали!
"""
TEXT_GET_STYLE = "Отлично! Теперь выбери стиль оформления 🖼️"
TEXT_FINAL = "✅ Готово!\nТвоя обновленная визуализация теперь готова влюблять в себя покупателей!"
ERROR_WRONG_INPUT = "❌ Пожалуйста, отправь фото, PDF (1 страница) или ссылку на изображение."
ERROR_PDF_PAGES = "❌ Ошибка! В PDF-файле должно быть не больше одной страницы."
ERROR_LINK = "❌ Не удалось загрузить изображение по этой ссылке. Убедись, что она ведет прямо на картинку (jpg, png)."

#interior_redesign
TEXT_GET_PHOTO_REDESIGN = "Загрузи *фото интерьера* (jpeg, jpg, png) или отправь ссылку на него. Чем лучше качество, тем круче результат! ✨"
TEXT_GET_ROOM_TYPE = "Отлично! Теперь выбери тип помещения, которое нужно обновить 👇"
ERROR_WRONG_INPUT_REDESIGN = "❌ Пожалуйста, отправь фото или ссылку на изображение."

#zero_design
TEXT_GET_FILE_ZERO_DESIGN = "Загрузи фото помещения — подойдёт ссылка или фото в jpeg, jpg, png или PDF."
TEXT_PHOTO_UPLOADED = "Отлично! 📸\nТеперь выбери, какое это помещение:"
TEXT_GET_FURNITURE_OPTION = """
Хочешь дизайн с мебелью или без?
🛋 С мебелью — сразу видно, как может выглядеть готовый интерьер.
▫️ Без мебели — чистое пространство, акцент на отделке и ощущении масштаба. Прекрасный вариант для новостроек.

Выбери вариант 👇
(Если не уверен — рекомендую с мебелью для вау-эффекта)
"""

#Подписка
SUB_FREE='''
🎁 Упс… Бесплатный лимит исчерпан
Ты использовал 2 бесплатных запроса — дальше только по подписке.

📦* Что даёт подписка:*
 — Пакет из 100 любых генераций
 — Доступ к 2D/3D и любым стилям
Стоимость пакета всего 2500 рублей!
'''
SUB_PAY='''
🪫 Упс… Лимит токенов исчерпан — теперь нужно обновить подписку.

📦* Что даёт подписка:*
 — Пакет из 100 любых генераций
 — Доступ к 2D/3D и любым стилям
Стоимость пакета всего 2500 рублей!
'''